# Prepping the data

In [2]:
# Importing relevant libraries
import pandas as pd
from pathlib import Path

# loading/reading csvfiles
students_df= pd.read_csv("../Resources/students_complete.csv")
schools_df = pd.read_csv("../Resources/schools_complete.csv")

# merging both dataframes for total district information
district_df = pd.merge(students_df, schools_df, how="left", on="school_name")
district_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

# District Summary Analysis

In [15]:
# Total number of unique schools

unique_schools_no = len(district_df["school_name"].unique())
unique_schools_no

15

In [16]:
# Total students
total_students_no = district_df["student_name"].count()
total_students_no

39170

In [17]:
# Total budget
total_budget_amount = schools_df["budget"].sum()
total_budget_amount

24649428

In [19]:
# Average math score
avg_math_score = district_df["math_score"].mean()
avg_math_score

78.98537145774827

In [20]:
# Average reading score
avg_reading_score = district_df["reading_score"].mean()
avg_reading_score

81.87784018381414

In [21]:
# % passing math
pass_math_count = district_df[(district_df["math_score"] >= 70)].count()["student_name"]
pass_math_percent = (pass_math_count/total_students_no) * 100
pass_math_percent

74.9808526933878

In [22]:
# % passing reading
pass_reading_count = district_df[(district_df["reading_score"] >= 70)].count()["student_name"]
pass_reading_percent = (pass_reading_count/total_students_no) * 100
pass_reading_percent

85.80546336482001

In [24]:
# % overall passing
pass_math_reading_count = district_df[
    (district_df["math_score"] >= 70) & (district_df["reading_score"] >= 70)
].count()["student_name"]
overall_passing_percent = (pass_math_reading_count/total_students_no) * 100
overall_passing_percent

65.17232575950983

In [34]:
# Creating a summary dataframe
district_summary = pd.DataFrame({
    "Total Schools": [unique_schools_no],
    "Total Students": total_students_no,
    "Total Budget": total_budget_amount,
    "Average Math Score": avg_math_score,
    "Average Reading Score": avg_reading_score,
    "% Passing Math": pass_math_percent,
    "% Passing Reading": pass_reading_percent,
    "% Overall Passing": overall_passing_percent
})

# Formatting some cells

district_summary ["Total Students"] = district_summary ["Total Students"].map("{:,}".format)
district_summary ["Total Budget"] = district_summary ["Total Budget"].map("${:,.2f}".format)

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

# School Summary

In [44]:
# School name
school_name_list = district_df["school_name"].unique()
school_name_list

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [40]:
# School type
school_types = schools_df.set_index(["school_name"])["type"]
school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [65]:
# Total students
school_total_students = district_df.groupby("school_name")["student_name"].count()
school_total_students

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: student_name, dtype: int64

In [66]:
district_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [77]:
# Total school budget
school_total_budget = district_df.groupby("school_name")["budget"].max()
school_total_budget

school_name
Bailey High School       3124928
Cabrera High School      1081356
Figueroa High School     1884411
Ford High School         1763916
Griffin High School       917500
Hernandez High School    3022020
Holden High School        248087
Huang High School        1910635
Johnson High School      3094650
Pena High School          585858
Rodriguez High School    2547363
Shelton High School      1056600
Thomas High School       1043130
Wilson High School       1319574
Wright High School       1049400
Name: budget, dtype: int64

In [42]:
#per student budget
per_student_budget =